'''
단순 조건문 ==> (1) 조건이 True인 경우만 처리하는 조건문.
if 조건문 :
<--->실행코드
<--->실행코드
<--->실행코드
단순 조건문 ==> (2) 조건이 True인 경우 / False인 경우
if 조건문 :
<--->실행코드
<--->실행코드
<--->실행코드
else :
<--->실행코드
<--->실행코드

복잡 조건문 ==> (3) 조건이 4개인 경우
if 조건문 :        if score >=90 :
<--->실행코드
<--->실행코드

elif 조건문2 :     elif score >= 80 :
<--->실행코드
<--->실행코드

elif 조건문3 :     elif score >=70 :
<--->실행코드
<--->실행코드

else :          else :
<--->실행코드
<--->실행코드

복잡 조건문 ==== > (4) 조건문 안에 조건문이 존재하는 조건문
if 조건문1 :
    실행 코드
    실행 코드
    if 조건문2 :
        실행 코드
        실행 코드
    else :
        실행 코드
        실행 코드
else :
    실행 코드
    실행 코드
'''